# DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
x = 'Utkarsh Rajput'
x.split()

['Utkarsh', 'Rajput']

In [3]:
from numpy.random import randn
randn(5,4)

array([[ 0.22810956,  0.18399995,  1.31240766, -0.54407678],
       [-0.80945672,  0.9708875 ,  0.21437296, -0.30146626],
       [ 0.69844284,  0.04745509,  1.39676577, -1.42337684],
       [ 1.3508266 ,  0.62583586, -1.32181223, -0.41028136],
       [ 0.64094196,  0.16779888, -0.81096017,  0.27892315]])

In [4]:
np.random.seed(101)
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [5]:
#df = pd.DataFrame  (DATA,  index=ROW_INDEX,  columns=SCHEMA  )

df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [6]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [7]:
#pass a list of column names
df[['X','Z']]

          X         Z
A  1.693723 -1.159119
B  0.390528  0.184502
C  0.072960  0.329646
D -0.754070  0.484752
E  1.901755  1.996652

In [8]:
# creating a new colunm
# add new column
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [9]:
# create reference only ---> shallow copy
df2=df 
df2

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [10]:
# Remove coloum from data frame
df.drop('new', axis=1) # axis = 1 --> coloum and axis =0 --> row
# just create a view

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [11]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [12]:
df.drop('new',axis=1,inplace=True) # delete premanatly---> (inplace=True)
#you can't store with new dataframe

In [13]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [14]:
df3=df.drop('W',axis=1,inplace=True)

In [15]:
df

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

In [16]:
df3

In [17]:
type(df3)

NoneType

In [18]:
# How to delete a row
df

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

In [19]:
df.drop('E',axis=0)

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752

In [20]:
df

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752
E  1.901755  0.238127  1.996652

In [21]:
df.drop('E',axis=0,inplace=True)

In [22]:
df

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752

In [23]:
#How to Select a Rows
df.loc['A']

X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [24]:
df.loc[['D','B']]

          X         Y         Z
D -0.754070 -0.943406  0.484752
B  0.390528  0.166905  0.184502

In [25]:
df.iloc[0]

X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [26]:
df.iloc[2]

X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [27]:
df.iloc[1:]

          X         Y         Z
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752

In [28]:
df.iloc[1:3]

          X         Y         Z
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646

In [29]:
# access row and coloumn
df.iloc[0,1]

-1.7060859307350775

In [30]:
df

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646
D -0.754070 -0.943406  0.484752

In [31]:
df.loc['B','Y']

0.16690463609281317

In [32]:
df.iloc[0,0]

1.693722925204035

In [33]:
df.iloc[[1,3],[0,2]]  # df.iloc[row,coloumn]

          X         Z
B  0.390528  0.184502
D -0.754070  0.484752

In [36]:
df.iloc[[0,3],[0,1]]

          X         Y
A  1.693723 -1.706086
D -0.754070 -0.943406

In [37]:
df.iloc[[1,2],[1,2]]

          Y         Z
B  0.166905  0.184502
C  0.638787  0.329646